IdeaRS.Connections
InternalForceOnSegmentData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.InternalForceOnSegmentData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.InternalForceOnSegmentData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class InternalForceOnSegmentData
The InternalForceOnSegmentData type exposes the following members.
Constructors
Name | Description
InternalForceOnSegmentData
Initializes a new instance of the InternalForceOnSegmentData class
Top
Properties
Name | Description
AbsPosition
 Abs position of load impulsm default 0
BeamSegmentId
 Gets or sets the id of the beam
ForceIn
 Gets or sets force position mode Position = 0, Node = 1, Bolts = 2,
Mx
 torsion moment
My
 bending moment
Mz
 bending moment
N
 normal force
Position
 Gets or sets position 0 - begin 1 - end
Qy
 shear force
Qz
 shear force
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace